aeonSolutions/AeonLabs-Safety-Health/Firmware Code/ESP32/Smart_EM_Device.ino
/*
 Copyright (c) 2024 Miguel Tomas, http://www.aeonlabs.science  https://github.com/aeonSolutions

License Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)
You are free to:
   Share — copy and redistribute the material in any medium or format
   Adapt — remix, transform, and build upon the material

The licensor cannot revoke these freedoms as long as you follow the license terms. Under the following terms:
Attribution — You must give appropriate credit, provide a link to the license, and indicate if changes were made. 
You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.

NonCommercial — You may not use the material for commercial purposes.

ShareAlike — If you remix, transform, or build upon the material, you must distribute your contributions under
 the same license as the original.

No additional restrictions — You may not apply legal terms or technological measures that legally restrict others
 from doing anything the license permits.

Notices:
You do not have to comply with the license for elements of the material in the public domain or where your use
 is permitted by an applicable exception or limitation.
No warranties are given. The license may not give you all of the permissions necessary for your intended use. 
For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.

Before proceeding to download any of AeonLabs software solutions for open-source development
 and/or PCB hardware electronics development make sure you are choosing the right license for your project. See 
https://github.com/aeonSolutions/PCB-Prototyping-Catalogue/wiki/AeonLabs-Solutions-for-Open-Hardware-&-Source-Development
 for Open Hardware & Source Development for more information.
*/

#define ENABLE_DEBUG  // comment this line to disable Serial debugging

#ifdef ENABLE_DEBUG
  #define log_I(x)  mySerial.println(x)
#else
  #define log_I(x)
#endif

// for compatibiliy across ESP32 MCUs 
#include <HardwareSerial.h>
#if defined(CONFIG_IDF_TARGET_ESP32) 
    #define mySerial Serial2
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
    #define mySerial Serial1
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
   #define mySerial Serial2
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
   #define mySerial Serial1
#endif

// ADC using the ADS1115 
#include <Adafruit_ADS1X15.h>
Adafruit_ADS1115 ads;  /* Use this for the 16-bit version */
// Pin connected to the ALERT/RDY signal for new sample notification.
constexpr int READY_PIN = 19;
bool ads115_offline = false;

#include <Wire.h>
#define SDA_PIN 5 
#define SCL_PIN 6
TwoWire I2C_BUS(0);
#define  LED_GREEN 18

// SPIF Fs File System 
#include <FS.h>            // Include the SPIFFS or LittleFS library
#include "SPIFFS.h"   // Use this for ESP32
// File details
String filePath = "/dataset.csv";    

// Base64 enconding
#include <Base64.h>  

// Local Time managemnent and NTP 
#include "esp_sntp.h"
#include "time.h"
#include "ESP32Time.h"
ESP32Time rtc(0);
uint32_t NTP_update_interval = 0;
long int last_ntp_sync = millis();
// NTP Time Server
const char* ntpServer_1 = "0.pool.ntp.org";
const char* ntpServer_2 = "time.nist.gov";
const char* ntpServer_3 = "1.pool.ntp.org";
const long timezone = 0;  // (utc+) TZ in hours 
const byte daysavetime = 1;

// WiFi Connectivity 
#include <WiFi.h>          // For ESP32 (or use <ESP8266WiFi.h> for ESP8266)
#include <NetworkClient.h>
#include <WiFiClientSecure.h>    // Secure client for HTTPS
#include <HTTPClient.h>
// Replace with your credentials  ---------------------------------
const char* ssid = "  ";
const char* password = "  ";

// ------------------------------------------------------------------
// GitHub credentials
const char* githubToken = "  "; // Replace with your GitHub token
const char* githubUser = "aeonSolutions";              // Replace with your GitHub username
const char* githubRepo = "AeonLabs-Safety-Health";                  // Replace with your GitHub repository
const char* githubBranch = "main";  
                       // The path to the file on the filesystem (SPIFFS/LittleFS)
const char* githubFilePath = "Measurements/datasets/dataset.csv";                      // Path in the GitHub repository

// Port and headers
const char* githubHost = "api.github.com";
const int httpsPort = 443;  // HTTPS port

// ******************************************************************
//              Setup
// ******************************************************************
void setup() {
  I2C_BUS.begin(SDA_PIN, SCL_PIN, 100000);

  // Initialize device
  #if defined(CONFIG_IDF_TARGET_ESP32) 
    mySerial.begin(115200);
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    mySerial.begin(115200, SERIAL_8N1, 20, 21); // rxpin, txpin
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    mySerial.begin(115200);
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    mySerial.begin(115200, SERIAL_8N1, 18, 17);// rxpin, txpin
  #endif

  log_I("Serial started....");
  delay(2000);

  pinMode(LED_GREEN, OUTPUT);

  // Set WiFi to station mode and disconnect from an AP if it was previously connected
  WiFi.disconnect();
  delay(100);

  log_I("Initialize filesystem...");
  // Initialize filesystem
  if (!SPIFFS.begin(true)) {
      log_I("Failed to mount file system");
      while (1){
        BlinkLED(LED_GREEN, 5);
      }
  }else{
      log_I("done!");
      BlinkLED(LED_GREEN, 1);      
  }

  // Connect to WiFi
  connectWIFI(5, 10);
  if ( WiFi.status() == WL_CONNECTED ){
    delay(1000);
    get_time();
  }

  if ( createNewDatasetFile(filePath) == false ){
    while (1){
      BlinkLED(LED_GREEN, 5);
    }
  }

  log_I("Getting differential reading from AIN0 (P) and AIN1 (N)");
  log_I("ADC Range: +/- 6.144V (1 bit = 3mV/ADS1015, 0.1875mV/ADS1115)");

  // The ADC input range (or gain) can be changed via the following
  // functions, but be careful never to exceed VDD +0.3V max, or to
  // exceed the upper and lower limits if you adjust the input range!
  // Setting these values incorrectly may destroy your ADC!
  //                                                                ADS1015  ADS1115
  //                                                                -------  -------
  ads.setGain(GAIN_TWOTHIRDS);  // 2/3x gain +/- 6.144V  1 bit = 3mV      0.1875mV (default)
  // ads.setGain(GAIN_ONE);        // 1x gain   +/- 4.096V  1 bit = 2mV      0.125mV
  // ads.setGain(GAIN_TWO);        // 2x gain   +/- 2.048V  1 bit = 1mV      0.0625mV
  // ads.setGain(GAIN_FOUR);       // 4x gain   +/- 1.024V  1 bit = 0.5mV    0.03125mV
  // ads.setGain(GAIN_EIGHT);      // 8x gain   +/- 0.512V  1 bit = 0.25mV   0.015625mV
  // ads.setGain(GAIN_SIXTEEN);    // 16x gain  +/- 0.256V  1 bit = 0.125mV  0.0078125mV

  if (!ads.begin(0x48, &I2C_BUS)) {
    ads115_offline= true;
    log_I("Failed to initialize ADS.");
    BlinkLED(LED_GREEN, 5);
  }
  pinMode(READY_PIN, INPUT);

  log_I("setup end. ");
}  // end setup

