aeonSolutions/AeonLabs-Safety-Health/Firmware Code/ESP32/Smart_EM_Device.ino
// -----------------------------------------------------------------------------
String getADSmeasurement(){
  log_I("\nStarting measurements....");
  BlinkLED(LED_GREEN, 1);
  int16_t res1;
  int16_t res2 ;
  float tension_A1;
  float tension_A2;
  float tension_dif = 0.0;

  float energy_A1;
  float energy_A2;
  float energy_dif = 0.0;
  
  if (ads115_offline){
    res1= 1.0;
    res2= 2.0; 
    tension_A1  = 1.0;
    tension_A2  = 2.0;
  }else{
    res1= ads.readADC_SingleEnded(1);
    res2= ads.readADC_SingleEnded(2);
    tension_A1  = ads.computeVolts(res1);
    tension_A2  = ads.computeVolts(res2);
  }
  tension_dif = tension_A1 - tension_A2;
    
  log_I("Voltage A1: " +String(tension_A1)+ " mV" ); 
  log_I("Voltage A2: " +String(tension_A2)+ " mV" ); 
  log_I("Differential 1-2: " + String(tension_dif) + " mV");
  
  log_I("Energy A1: " + String(energy_A1,10) + " mW" ); 
  log_I("Energy A2: " + String(energy_A2,10) + " mW" ); 
  log_I("Differential 1-2: " + String(energy_dif,10) + " mW");

  //  E = 1/2 x C x V^2 -- Energy equals one-half times the capacitance (in farads) times the square of the voltage.
  //  The unit is watt-seconds, abbreviated Ws, or W-s
  energy_A1 = (float)0.5 * (float)100 * (float)0.000001 * (float)tension_A1;
  energy_A2 = (float)0.5 * (float)100 * (float)0.000001 * (float)tension_A2;
  energy_dif = energy_A1 - energy_A2;


  String dataRecord = String( rtc.getTimeDate(true) ) + ";" + String(tension_A1)+";"+ String(tension_A2)+";"+ String(tension_dif) + ";" + String(energy_A1,10)+";"+ String(energy_A2,10)+";"+ String(energy_dif,10)  +";\n";     
  return dataRecord;
}  // end getADSmeasurement

/******************************************************************************************
 * Main Loop
 *****************************************************************************************/
unsigned long MEASUREMENT_INTERVAL        = 0.1 * 60 * 1000; // 10 sec //minutes to mili
unsigned long MEASUREMENT_INTERVAL_GITHUB = 0.2 * 60 * 1000;
long int last_upload                      = millis();
long int last_github_upload               = millis();

// adc_power_release()

void loop() {
  delay(100);
  if (millis() - last_ntp_sync > NTP_update_interval ){
    get_time();
    last_ntp_sync= millis();
  }

  // do measurements
  if (millis() - last_upload > MEASUREMENT_INTERVAL) {
    writeDataRecord( getADSmeasurement() );
    last_upload = millis();
  }

  if (millis() - last_github_upload > MEASUREMENT_INTERVAL_GITHUB) {
    bool blob_ok = true;
    log_I("Starting upload....");
    // get the SHA of the base tree for the file
    String oldFileSHA = getFileSHA();
   // PUSH the new updated file 
    String newfileSHA = uploadFileInChunks();

    if (newfileSHA.length() <40 ){
      log_I("Incorrect New File SHA Blob size (<40) \n PUSH to GitHub cannot continue.");
      blob_ok = false;
    }
    
    // get parent 
    String parentSHA = "";
    if (blob_ok == true)
      parentSHA = getParents();

    if (parentSHA.length() <40 ){
      log_I("Incorrect commit SHA Blob size (<40) \n PUSH to GitHub cannot continue.");
      blob_ok = false;
    }

    // create a new tree
    String newTreeSHA = "";
    if (blob_ok == true)
      newTreeSHA = createTree(newfileSHA, parentSHA);
    
    if (newTreeSHA.length() <40 ){
      log_I("Incorrect New Tree SHA Blob size (<40) \n PUSH to GitHub cannot continue.");
      blob_ok = false;
    }else if (parentSHA.length() <40 ){
      log_I("Incorrect parent SHA Blob size (<40) \n PUSH to GitHub cannot continue.");
      blob_ok = false;
    }

    // Commit the tree
    String commitSHA = "";
    if (blob_ok == true)
      commitSHA = createCommit(newTreeSHA, parentSHA);

    if (newfileSHA.length() <40 ){
      log_I("Incorrect commit SHA Blob size (<40) \n PUSH to GitHub cannot continue.");
      blob_ok = false;
    }

    // Update the reference (branch) to point to the new commit
    if (blob_ok == true)
      updateReference(commitSHA);

    last_github_upload = millis();
  }
}  // end loop 

//-------------------------------------------------------------------------------
// For a somewhat deltailed tutorial go here: 
// https://dev.to/bro3886/create-a-folder-and-push-multiple-files-under-a-single-commit-through-github-api-23kc

// Function to send a GET request to GitHub and extract the file's SHA blob
String getFileSHA() {
  if (WiFi.status() != WL_CONNECTED) {
    log_I("WIFI not available. skipping upload.");
    return "-2";
  }
  
  log_I("Free internal heap before TLS " + String( ESP.getFreeHeap()) );

  String sha = "";  

  // Create the GitHub API URL
  String githubUrl = "https://api.github.com/repos/" + String(githubUser) + "/" + String(githubRepo) + "/contents/" + String(githubFilePath) + "?ref=" + String(githubBranch);

  log_I("Requesting URL: " + githubUrl );

  // Begin the GET request
  HTTPClient http;
  http.begin(githubUrl);
  http.addHeader("Authorization", "token " + String(githubToken));
  http.addHeader("Content-Type", "application/json");
  
  int httpResponseCode = http.GET();
  if (httpResponseCode > 0) {
    String responseBody = http.getString();
    http.end();
    log_I("current File SHA Response: " + responseBody);
    String FileSHA = extractSHA(responseBody);
    if (FileSHA.length() <40 ){
      log_I("Incorrect File SHA Blob size (<40)");
      return "-6";
    }
    log_I("Current File SHA Blob:" + FileSHA );
    return FileSHA;
  } else {
    log_I("Failed to retrieve File SHA, err:" + http.errorToString(httpResponseCode) );
    http.end();
    return "-3";
  }
}  // end getFileSHA

// ------------------------------------------------------------------------------------------------------
String uploadFileInChunks() {
  WiFiClientSecure client;
  
  client.setInsecure();  // Use this only for testing; skips certificate verification
  if (client.connect(githubHost, 443) == false ) {
    log_I ("failed to connect to " + String(githubHost) );
  }

  String url = "/repos/" + String(githubUser) + "/" + String(githubRepo) + "/git/blobs";
  log_I("Requesting URL: " + url );

  String encodedChunk;
  String fileBlobs = "";
  
  String json_part_1 = "{ \"content\": \"";
  String json_part_2 = "\", \"encoding\": \"base64\" }";

  const size_t chunkSize = 132;  // Adjust based on available memory
  uint8_t buffer[chunkSize];

  File fileToSend = SPIFFS.open(filePath, "r");
  if (!fileToSend) {
      log_I("Failed to open file for reading");
      BlinkLED(LED_GREEN, 5);
      return "-5";
  }
  unsigned long fileSize = fileToSend.size(); 
  unsigned long content_len = encode_base64_length(fileSize);

  log_I("File Content size = " + String( fileSize ) );
  log_I("Base 64 Content length = " + String( content_len ) );
  log_I("ratio = " + String( (float)( (float)content_len/fileSize), 2 ) );

  // Send HTTP POST request to create blob
  client.println("POST " + url + " HTTP/1.1");
  client.println("Host: " + String(githubHost) );
  client.println("Authorization: Bearer " + String(githubToken));
  client.println("User-Agent: AeonSolutions");
  client.println("Content-Type: application/json");
  client.println("Connection: close");
  client.print("Content-Length: ");
  client.println(content_len + json_part_1.length() +  json_part_2.length() );  // Calculate content length
  client.print("\r\n");
  client.print("\r\n");
  client.print(json_part_1);

