aeonSolutions/AeonLabs-Safety-Health/Firmware Code/ESP32/Smart_EM_Device.ino
  mySerial.print(json_part_1);
  long int temp = 0;
  while (fileToSend.available()) {
    size_t bytesRead = fileToSend.read(buffer, chunkSize);
    encodedChunk = base64::encode(buffer, bytesRead);
    client.print( encodedChunk);
    temp += encodedChunk.length();
    mySerial.print(encodedChunk);
  }
  mySerial.print(json_part_2);

  fileToSend.close();
  log_I("Content len sent: " + String(temp) );

  client.println(json_part_2);
  client.print("\r\n");

  while (client.connected()) {
    String line = client.readStringUntil('\n');
    if (line == "\r") {
      break;
    }
  }

  // Read the response body
  String responseBody = client.readString();
  client.stop();

  log_I("PUSH file Response:" + responseBody);

  String blobSHA = extractSHA(responseBody);
  log_I("PUSH File SHA Blob: " + blobSHA);
  if (blobSHA.length() <40 ){
    log_I("Incorrect Push File Blob size (<40)");
    return "-6";
  }
  return blobSHA;
}  // end uploadFileInChunks

// ----------------------------------------------------------------------------------
String createTree(String newfileSHA, String parentSHA) {
  if (WiFi.status() != WL_CONNECTED) {
    log_I("WIFI not available. skipping upload.");
    return "-2";
  }

  HTTPClient http;
  String url = "https://api.github.com/repos/" + String(githubUser) + "/" + String(githubRepo) + "/git/trees";
  log_I("Requesting URL: " + url );

  http.begin(url);
  http.addHeader("Authorization", "Bearer " + String(githubToken));
  http.addHeader("Content-Type", "application/json");
  http.addHeader("User-Agent", "AeonSolutions");

  // Create tree payload with the blob SHA  : not the  latestTreeSHA
  String payload = "{"
                    "\"base_tree\": \"" + parentSHA + "\","
                    "\"tree\": ["
                    "{ \"path\": \"" + githubFilePath + "\", \"mode\": \"100644\", \"type\": \"blob\", \"sha\": \"" + newfileSHA + "\" }"
                    "]"
                    "}";

  log_I("Create Tree payload: " + payload);      

  int httpResponseCode = http.POST(payload);
  http.end();

  if (httpResponseCode > 0) {
    String response = http.getString();
    log_I("Tree creation response: " + response);

    String newTreeSHA = extractSHA(response);
    log_I("New Tree SHA blob: " + newTreeSHA);
    return newTreeSHA;
  } else {
    log_I("Error creating tree: " + http.errorToString(httpResponseCode));
    return "-3";
  }  
}  //end createTree


// ------------------------------------------------------------------------------------------------------------------
String getParents() {
  if (WiFi.status() != WL_CONNECTED) {
    log_I("WIFI not available. skipping upload.");
    return "-2";
  }

  HTTPClient http;
  String url = "https://api.github.com/repos/" + String(githubUser) + "/" + String(githubRepo) + "/git/refs/heads/" + String(githubBranch);
  log_I("Requesting URL: " + url );

  http.begin(url);
  http.addHeader("Authorization", "Bearer " + String(githubToken));
  http.addHeader("Content-Type", "application/json");
  http.addHeader("User-Agent", "AeonSolutions");
  
  int httpResponseCode = http.GET();

  if (httpResponseCode > 0) {
    String responseBody = http.getString();
    http.end();
    log_I("Parents response: " + responseBody);
    String blobSHA = extractSHA(responseBody);
    log_I("Parents SHA Blob: " + blobSHA);
    if (blobSHA.length() <40 ){
      log_I("Incorrect Blob size (<40)");
      return "-6";
    }
    return blobSHA;
  } else {
    http.end();
    log_I("Error updating reference: " + http.errorToString(httpResponseCode));
    return "-4";
  }
}  // end getParents

//-------------------------------------------------------------------------------------------
String createCommit(String newTreeSHA, String parentSHA) {
  if (WiFi.status() != WL_CONNECTED) {
    log_I("WIFI not available. skipping upload.");
    return "-2";
  }

  HTTPClient http;
  String url = "https://api.github.com/repos/" + String(githubUser) + "/" + String(githubRepo) + "/git/commits";
  log_I("Requesting URL: " + url );

  http.begin(url);
  http.addHeader("Authorization", "Bearer " + String(githubToken));
  http.addHeader("Content-Type", "application/json");
  http.addHeader("User-Agent", "AeonSolutions");

  // Create commit payload
  String commitMessage = "Upload file to GitHub from Arduino";
  String payload = "{"
                    "\"message\": \"" + commitMessage + "\","
                    "\"tree\": \"" + newTreeSHA + "\","
                    "\"parents\": [\"" + parentSHA + "\"]"
                    "}";

  log_I("Create Commit payload: " + payload);      

  int httpResponseCode = http.POST(payload);

  if (httpResponseCode > 0) {
    String response = http.getString();
    http.end();

    log_I("Commit creation response: " + response);

    String newCommitSHA = extractSHA(response);

    log_I("New Commit SHA blob: " + newCommitSHA);
    if (newCommitSHA.length() <40 ){
      log_I("Incorrect Blob size (<40)");
      return "-6";
    }
    return newCommitSHA;
  } else {
    http.end();
    log_I("Error creating commit: " + http.errorToString(httpResponseCode));
    return "-4";
  }  
}  // end createCommit

// ------------------------------------------------------------------------------------------------------------------
String updateReference(String newCommitSHA) {
  if (WiFi.status() != WL_CONNECTED) {
    log_I("WIFI not available. skipping upload.");
    return "-2";
  }

  HTTPClient http;
  String url = "https://api.github.com/repos/" + String(githubUser) + "/" + String(githubRepo) + "/git/refs/heads/" + String(githubBranch);
  log_I("Requesting URL: " + url );

  http.begin(url);
  http.addHeader("Authorization", "Bearer " + String(githubToken));
  http.addHeader("Content-Type", "application/json");
  http.addHeader("User-Agent", "AeonSolutions");

  // Update ref payload
  String payload = "{ \"sha\": \"" + newCommitSHA + "\", \"force\": true }";
  
  log_I("Update References payload: " + payload);      
  
  int httpResponseCode = http.PATCH(payload);

  if (httpResponseCode > 0) {
    String response = http.getString();
    String code = http.errorToString(httpResponseCode);
    http.end();
    log_I("Reference update response ("+ code +"): " + response);
    return code;
  } else {
    log_I("Error updating reference: " + http.errorToString(httpResponseCode));
    http.end();
    return "-4";
  }
}  // end createCommit

// --------------------------------------------------------------------------
//       support functions
// ----------------------------------------------------------------------------

