aeonSolutions/AeonLabs-Safety-Health/Firmware Code/ESP32/Smart_EM_Device.ino
// -----------------------------------------------------------------------------
// Function to parse the JSON response and extract the 'sha' field
String extractSHA(String response) {
  int posStart = response.indexOf("sha");
  int posEnd = response.indexOf("\"", posStart + 8 );
  if (posStart == -1){
    log_I("SHA Blob not found");
    return "-4";
  }

  String sha = response.substring(posStart+6, posEnd);
  return sha;
}  // end extractSHA

//--------------------------------------------------------------------------------------------------------------------
void writeDataRecord(String dataRecord){
  File file = SPIFFS.open(filePath, FILE_APPEND);
  if (!file) {
    log_I("Failed to open the  file");
    BlinkLED(LED_GREEN, 5);
    return;
  }

  // Write data to the file
  if (file.print(dataRecord)) {
      log_I("Data written successfully!");
  } else {
    log_I("Failed to write data");
    BlinkLED(LED_GREEN, 5);
  }

  // Close the file
  file.close();
}  // end writeDataRecord

//--------------------------------------------
bool createNewDatasetFile(String file_Path){
  // Check if the file exists
  if (!SPIFFS.exists(file_Path)) {
    // Create and open a new file
    File file = SPIFFS.open(file_Path, FILE_WRITE);
    if (!file) {
      log_I("Failed to create file");
      return false;
    }  
  
    log_I("File created successfully!");

    BlinkLED(LED_GREEN, 1);
    // Write data to the file
    if (file.print("Date & Tme; V(A1) mV; V(A2) mV; V(diff) mV; E(A1) mW; E(A2) mW; E(diff) mW; \n")) {
      log_I("Data written successfully!");
      // Close the file
      file.close();
      return true;   
    } else {
      log_I("Failed to write data");
      BlinkLED(LED_GREEN, 5);
      // Close the file
      file.close();
      return false;   
    }
  }
}  // end createNewDatasetFile

// --------------------------------------------------------------------------------------------------------------------------
 unsigned long encode_base64_length(unsigned long input_length) {
    unsigned long base = input_length * 4 / 3;  // Adjust size for Base64 encoding
    int mod = base % 4;
    return (base + mod); 
 }  // end encode_base64_length

// *******************************************************************
// *******************************************************************
void BlinkLED(int LED, int duration) {
  digitalWrite(LED, HIGH);   // sets the digital pin 13 on
  delay(duration * 1000);    // waits for a second
  digitalWrite(LED, LOW);   // sets the digital pin 13 off 
}  // end BlinkLED

//*******************************************************************
void get_time(){
  tm timeinfo;
  log_I("Connecting to the Time Server....");
  // Init and get the time
  sntp_set_sync_mode(SNTP_SYNC_MODE_SMOOTH);
  configTime( 3600*timezone, daysavetime*3600, ntpServer_1, ntpServer_2, ntpServer_3 );
  timeval tv;
  sntp_sync_time(&tv);
  log_I("Waiting for Time Sync");
  
  if (getLocalTime(&timeinfo) )
    rtc.setTimeStruct(timeinfo);
  
  get_sntp_sync_status();
  get_sntp_sync_mode();

  NTP_update_interval = sntp_get_sync_interval(); // in milisec 
  log_I("NTP Sync Interval = " + String(NTP_update_interval) );

  BlinkLED(LED_GREEN, 1);     
}  // end get_time

//*******************************************************************
void connectWIFI(int attempts, int duration){
    for(int i=0; i<attempts; i++){

      log_I("Attempt n. " + String(i+1) + " to  connect WIFI" );
  
      WiFi.disconnect();
      WiFi.mode(WIFI_STA);
      delay(100);
      WiFi.begin(ssid, password);
      WiFi.setTxPower( WIFI_POWER_11dBm );
      long int startConn = millis();
      while ( WiFi.status() != WL_CONNECTED &&   (millis() - startConn < (duration*1000) ) ) {
        delay(1000);
        log_I(".");
      }
      
      if ( WiFi.status() == WL_CONNECTED ){
        log_I("\nConnected to WiFi!");
        BlinkLED(LED_GREEN, 1);
        return;
      }     
    }
}  // end connectWIFI

//********************************************************************
void get_sntp_sync_status(){
  sntp_sync_status_t syncStatus = sntp_get_sync_status();
  switch (syncStatus) {
    case SNTP_SYNC_STATUS_RESET:
      log_I("SNTP_SYNC_STATUS_RESET");
      break;

    case SNTP_SYNC_STATUS_COMPLETED:
      log_I("SNTP_SYNC_STATUS_COMPLETED");
      break;

    case SNTP_SYNC_STATUS_IN_PROGRESS:
      log_I("SNTP_SYNC_STATUS_IN_PROGRESS");
      break;

    default:
      log_e("Unknown Sync Status");
      break;
  }
}  // end get_sntp_sync_status

//******************************************************************
void get_sntp_sync_mode(){
  sntp_sync_mode_t mode = sntp_get_sync_mode();
  switch (mode) {
    case SNTP_SYNC_MODE_IMMED:
      log_I("SNTP_SYNC_MODE_IMMED");
      break;

    case SNTP_SYNC_MODE_SMOOTH:
      log_I("SNTP_SYNC_MODE_SMOOTH");
      break;

    default:
      log_e("Unknown Sync Mode");
      break;
  }
}  // end get_sntp_sync_mode
